-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主机： dex-mysql
-- 生成日期： 2023-02-16 05:25:18
-- 服务器版本： 8.0.32
-- PHP 版本： 8.0.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `SongSwap`
--
CREATE DATABASE IF NOT EXISTS `SongSwap` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `SongSwap`;

-- --------------------------------------------------------

--
-- 表的结构 `ss_change_log`
--

CREATE TABLE IF NOT EXISTS `ss_change_log` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `account` int NOT NULL DEFAULT '0' COMMENT '账号ID',
  `before_icp_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'icp变动前数量',
  `icp_tag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '变动符号 1 增加 -1 减少',
  `change_icp_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'icp变动数量',
  `after_icp_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'icp变动后数量',
  `before_eth_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'eth变动前数量',
  `eth_tag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '变动符号 1 增加 -1 减少',
  `change_eth_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'eth变动数量',
  `after_eth_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'eth变动后数量',
  `before_usdt_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'usdt变动前数量',
  `usdt_tag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '变动符号 1 增加 -1 减少',
  `change_usdt_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'usdt变动数量',
  `after_usdt_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'usdt变动后数量',
  `before_btc_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'btc变动前数量',
  `btc_tag` tinyint(1) NOT NULL DEFAULT '1' COMMENT '变动符号 1 增加 -1 减少',
  `change_btc_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'btc变动数量',
  `after_btc_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'btc变动后数量',
  `create_time` int NOT NULL DEFAULT '0' COMMENT '创建时间',
  `comment` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '备注',
  `type` tinyint NOT NULL DEFAULT '0' COMMENT '变更类型 0 后台变更 1 充值 2 提现 3 兑换',
  PRIMARY KEY (`id`),
  KEY `account` (`account`),
  KEY `type` (`type`)
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='coin 变动记录';

--
-- 转存表中的数据 `ss_change_log`
--

INSERT INTO `ss_change_log` (`id`, `account`, `before_icp_coin`, `icp_tag`, `change_icp_coin`, `after_icp_coin`, `before_eth_coin`, `eth_tag`, `change_eth_coin`, `after_eth_coin`, `before_usdt_coin`, `usdt_tag`, `change_usdt_coin`, `after_usdt_coin`, `before_btc_coin`, `btc_tag`, `change_btc_coin`, `after_btc_coin`, `create_time`, `comment`, `type`) VALUES
(1, 1, '0.000000000000000000', 1, '10.000000000000000000', '10.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', 1674201084, '后台变更', 0),
(2, 1, '10.000000000000000000', -1, '10.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', 1674201487, '后台变更', 0),
(3, 1, '0.000000000000000000', 1, '1000000.000000000000000000', '1000000.000000000000000000', '0.000000000000000000', 1, '10.000000000000000000', '10.000000000000000000', '0.000000000000000000', 1, '100000.000000000000000000', '100000.000000000000000000', '0.000000000000000000', 1, '8.000000000000000000', '8.000000000000000000', 1674201547, '后台变更', 0),
(4, 12, '0.000000000000000000', 1, '10.000000000000000000', '10.000000000000000000', '0.000000000000000000', 1, '30.000000000000000000', '30.000000000000000000', '0.000000000000000000', 1, '20.000000000000000000', '20.000000000000000000', '0.000000000000000000', 1, '40.000000000000000000', '40.000000000000000000', 1674205152, '后台变更', 0),
(5, 21, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '10.000000000000000000', '10.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', 1674399482, '充值', 1),
(6, 20, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '10.000000000000000000', '10.000000000000000000', 1674399728, '充值', 1),
(7, 19, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '100.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', 1674399763, '充值', 1),
(8, 18, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '1000.000000000000000000', '1000.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', 1674399769, '充值', 1),
(9, 17, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '1000.000000000000000000', '1000.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', 1674399773, '充值', 1),
(10, 4, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1, '0.001000000000000000', '0.001000000000000000', 1674411960, '充值', 1),
(11, 24, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '999.890000000000000000', 1, '0.000000000000000000', '999.890000000000000000', '1000.000000000000000000', -1, '0.110000000000000000', '999.890000000000000000', '100.000000000000000000', 1, '0.000000000000000000', '100.000000000000000000', 1674565844, '提现', 2),
(12, 21, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '100.000000000000000000', -1, '0.100000000000000000', '99.900000000000000000', 1674566146, '提现', 2),
(13, 20, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '110.000000000000000000', -1, '0.100000000000000000', '109.900000000000000000', 1674566198, '提现', 2),
(14, 19, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '1100.000000000000000000', 1, '0.000000000000000000', '1100.000000000000000000', '100.000000000000000000', -1, '0.100000000000000000', '99.900000000000000000', 1674566201, '提现', 2),
(15, 18, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '2000.000000000000000000', 1, '0.000000000000000000', '2000.000000000000000000', '100.000000000000000000', -1, '0.100000000000000000', '99.900000000000000000', 1674566203, '提现', 2),
(16, 17, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '2000.000000000000000000', 1, '0.000000000000000000', '2000.000000000000000000', '100.000000000000000000', -1, '0.100000000000000000', '99.900000000000000000', 1674566205, '提现', 2),
(17, 16, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '100.000000000000000000', -1, '0.100000000000000000', '99.900000000000000000', 1674566207, '提现', 2),
(18, 15, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '100.000000000000000000', -1, '0.100000000000000000', '99.900000000000000000', 1674566210, '提现', 2),
(19, 1, '1000000.000000000000000000', 1, '0.051480000000000000', '1000000.051480000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '101000.000000000000000000', -1, '0.100000000000000000', '100999.900000000000000000', '107.900000000000000000', 1, '0.000000000000000000', '107.900000000000000000', 1674675714, '兑换', 3),
(20, 1, '1000000.051480000000000000', -1, '100.000000000000000000', '999900.051480000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100999.900000000000000000', 1, '0.000000000000000000', '100999.900000000000000000', '107.900000000000000000', 1, '0.008553000000000000', '107.908553000000010000', 1674675864, '兑换', 3),
(21, 1, '999900.051480000000000000', 1, '51.480051000000000000', '999951.531531000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100999.900000000000000000', -1, '100.000000000000000000', '100899.900000000000000000', '107.908553000000000000', 1, '0.000000000000000000', '107.908553000000000000', 1674676062, '兑换', 3),
(22, 1, '999951.531531000000000000', 1, '51.480051000000000000', '1000003.011582000100000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100899.900000000000000000', -1, '100.000000000000000000', '100799.900000000000000000', '107.908553000000000000', 1, '0.000000000000000000', '107.908553000000000000', 1674676066, '兑换', 3),
(23, 1, '1000003.011582000000000000', 1, '51.480051000000000000', '1000054.491633000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100799.900000000000000000', -1, '100.000000000000000000', '100699.900000000000000000', '107.908553000000000000', 1, '0.000000000000000000', '107.908553000000000000', 1674676069, '兑换', 3),
(24, 1, '1000054.491633000000000000', 1, '51.480051000000000000', '1000105.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100699.900000000000000000', -1, '100.000000000000000000', '100599.900000000000000000', '107.908553000000000000', 1, '0.000000000000000000', '107.908553000000000000', 1674676070, '兑换', 3),
(25, 1, '1000105.971684000000000000', -1, '1000.000000000000000000', '999105.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '107.908553000000000000', 1, '0.085581000000000000', '107.994134000000000000', 1674676090, '兑换', 3),
(26, 1, '999105.971684000000000000', -1, '1000.000000000000000000', '998105.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '107.994134000000000000', 1, '0.085581000000000000', '108.079715000000010000', 1674676092, '兑换', 3),
(27, 1, '998105.971684000000000000', -1, '1000.000000000000000000', '997105.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.079715000000000000', 1, '0.085581000000000000', '108.165296000000000000', 1674676093, '兑换', 3),
(28, 1, '997105.971684000000000000', -1, '1000.000000000000000000', '996105.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.165296000000000000', 1, '0.085581000000000000', '108.250877000000000000', 1674676094, '兑换', 3),
(29, 1, '996105.971684000000000000', -1, '100.000000000000000000', '996005.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.250877000000000000', 1, '0.008552000000000000', '108.259429000000000000', 1674676177, '兑换', 3),
(30, 1, '996005.971684000000000000', -1, '1000.000000000000000000', '995005.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.259429000000000000', 1, '0.085561000000000000', '108.344990000000000000', 1674676229, '兑换', 3),
(31, 1, '995005.971684000000000000', -1, '1000.000000000000000000', '994005.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.344990000000000000', 1, '0.085561000000000000', '108.430551000000000000', 1674676230, '兑换', 3),
(32, 1, '994005.971684000000000000', -1, '1000.000000000000000000', '993005.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.430551000000000000', 1, '0.085561000000000000', '108.516111999999990000', 1674676231, '兑换', 3),
(33, 1, '993005.971684000000000000', -1, '1000.000000000000000000', '992005.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.516112000000000000', 1, '0.085561000000000000', '108.601673000000000000', 1674676232, '兑换', 3),
(34, 1, '992005.971684000000000000', -1, '1000.000000000000000000', '991005.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.601673000000000000', 1, '0.085561000000000000', '108.687234000000000000', 1674676233, '兑换', 3),
(35, 1, '991005.971684000000000000', -1, '1000.000000000000000000', '990005.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.687234000000000000', 1, '0.085561000000000000', '108.772795000000000000', 1674676234, '兑换', 3),
(36, 1, '990005.971684000000000000', -1, '100.000000000000000000', '989905.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.772795000000000000', 1, '0.008557000000000000', '108.781352000000000000', 1674676328, '兑换', 3),
(37, 1, '989905.971684000000000000', -1, '100.000000000000000000', '989805.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.781352000000000000', 1, '0.008557000000000000', '108.789909000000000000', 1674676331, '兑换', 3),
(38, 1, '989805.971684000000000000', -1, '100.000000000000000000', '989705.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.789909000000000000', 1, '0.008557000000000000', '108.798465999999990000', 1674676332, '兑换', 3),
(39, 1, '989705.971684000000000000', -1, '100.000000000000000000', '989605.971684000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', 1, '0.000000000000000000', '100599.900000000000000000', '108.798466000000000000', 1, '0.008557000000000000', '108.807023000000000000', 1674676334, '兑换', 3),
(40, 1, '989605.971684000000000000', 1, '0.079833000000000000', '989606.051517000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.900000000000000000', -1, '0.100000000000000000', '100599.799999999990000000', '108.807023000000000000', 1, '0.000000000000000000', '108.807023000000000000', 1674680311, '兑换', 3),
(41, 1, '989606.051517000000000000', 1, '0.065646000000000000', '989606.117163000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.800000000000000000', -1, '0.100000000000000000', '100599.700000000000000000', '108.807023000000000000', 1, '0.000000000000000000', '108.807023000000000000', 1674791372, '兑换', 3),
(42, 2, '0.000000000000000000', 1, '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '1000.000000000000000000', 1, '0.000000000000000000', '1000.000000000000000000', '100.000000000000000000', -1, '0.100000000000000000', '99.900000000000000000', 1674804798, '提现', 2),
(43, 1, '989606.117163000000000000', -1, '101.111000000000000000', '989505.006163000000000000', '1010.000000000000000000', 1, '0.000000000000000000', '1010.000000000000000000', '100599.700000000000000000', 1, '0.000000000000000000', '100599.700000000000000000', '108.807023000000000000', 1, '0.006392000000000000', '108.813415000000000000', 1674843538, '兑换', 3),
(44, 1, '989505.006163000000000000', -1, '123.000000000000000000', '989382.006163000000000000', '1009.760000000000000000', 1, '0.108478000000000000', '1009.868478000000000000', '100599.700000000000000000', 1, '0.000000000000000000', '100599.700000000000000000', '108.813415000000000000', 1, '0.000000000000000000', '108.813415000000000000', 1676293386, '兑换', 3),
(45, 1, '989382.006163000000000000', -1, '123.000000000000000000', '989259.006163000000000000', '1009.868478000000000000', 1, '0.108476000000000000', '1009.976954000000000000', '100599.700000000000000000', 1, '0.000000000000000000', '100599.700000000000000000', '108.813415000000000000', 1, '0.000000000000000000', '108.813415000000000000', 1676293528, '兑换', 3),
(46, 1, '989382.006163000000000000', -1, '123.000000000000000000', '989259.006163000000000000', '1009.868478000000000000', 1, '0.000000000000000000', '1009.868478000000000000', '100599.700000000000000000', 1, '0.000000000000000000', '100599.700000000000000000', '108.813415000000000000', 1, '0.007446000000000000', '108.820861000000000000', 1676293537, '兑换', 3),
(47, 1, '989136.006163000000000000', -1, '123.000000000000000000', '989013.006163000000000000', '1009.976954000000000000', 1, '0.108520000000000000', '1010.085474000000000000', '100599.700000000000000000', 1, '0.000000000000000000', '100599.700000000000000000', '108.820861000000000000', 1, '0.000000000000000000', '108.820861000000000000', 1676294630, '兑换', 3),
(48, 1, '989013.006163000000000000', -1, '23525.000000000000000000', '965488.006163000000000000', '1010.085474000000000000', 1, '25.998274000000000000', '1036.083748000000000000', '100599.700000000000000000', 1, '0.000000000000000000', '100599.700000000000000000', '108.820861000000000000', 1, '0.000000000000000000', '108.820861000000000000', 1676378655, '兑换', 3),
(49, 1, '965488.006163000000000000', -1, '123.000000000000000000', '965365.006163000000000000', '1036.083748000000000000', 1, '0.000000000000000000', '1036.083748000000000000', '100599.700000000000000000', 1, '205.631400000000000000', '100805.331400000000000000', '108.820861000000000000', 1, '0.000000000000000000', '108.820861000000000000', 1676452753, '兑换', 3),
(50, 1, '965365.006163000000000000', -1, '123.000000000000000000', '965242.006163000000000000', '1036.083748000000000000', 1, '0.000000000000000000', '1036.083748000000000000', '100805.331400000000000000', 1, '205.631400000000000000', '101010.962800000000000000', '108.820861000000000000', 1, '0.000000000000000000', '108.820861000000000000', 1676452754, '兑换', 3),
(51, 1, '965242.006163000000000000', -1, '123.000000000000000000', '965119.006163000000000000', '1036.083748000000000000', 1, '0.000000000000000000', '1036.083748000000000000', '101010.962800000000000000', 1, '205.631400000000000000', '101216.594200000000000000', '108.820861000000000000', 1, '0.000000000000000000', '108.820861000000000000', 1676452813, '兑换', 3),
(52, 1, '965119.006163000000000000', -1, '18.000000000000000000', '965101.006163000000000000', '1036.083748000000000000', 1, '0.000000000000000000', '1036.083748000000000000', '101216.594200000000000000', 1, '30.092400000000000000', '101246.686600000000000000', '108.820861000000000000', 1, '0.000000000000000000', '108.820861000000000000', 1676452889, '兑换', 3),
(53, 1, '965101.006163000000000000', -1, '123.000000000000000000', '964978.006163000000000000', '1036.083748000000000000', 1, '0.000000000000000000', '1036.083748000000000000', '101246.686600000000000000', 1, '205.631400000000000000', '101452.318000000000000000', '108.820861000000000000', 1, '0.000000000000000000', '108.820861000000000000', 1676452900, '兑换', 3),
(54, 1, '964978.006163000000000000', -1, '1.000000000000000000', '964977.006163000000000000', '1036.083748000000000000', 1, '0.000000000000000000', '1036.083748000000000000', '101452.318000000000000000', 1, '1.671800000000000000', '101453.989800000000000000', '108.820861000000000000', 1, '0.000000000000000000', '108.820861000000000000', 1676452919, '兑换', 3);

-- --------------------------------------------------------

--
-- 表的结构 `ss_pairs`
--

CREATE TABLE IF NOT EXISTS `ss_pairs` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '交易对',
  `platform` char(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '0xca143ce32fe78f1f7019d7d551a6402fc5350c73' COMMENT '平台合约地址',
  `in_contract` tinyint NOT NULL DEFAULT '0' COMMENT '是否在合约中：1 是 0 否',
  `from_address` char(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT 'from_coin_address',
  `from_coin_name` char(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT 'from_coin_name',
  `from_coin_decimals` tinyint NOT NULL DEFAULT '0' COMMENT 'from_coin_decimals',
  `to_address` char(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT 'to_coin_address',
  `to_coin_name` char(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT 'to_coin_name',
  `to_coin_decimals` tinyint NOT NULL DEFAULT '0' COMMENT 'to_coin_decimals',
  `pair_address` char(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT 'pair_address',
  PRIMARY KEY (`id`),
  KEY `from_coin_name` (`from_coin_name`),
  KEY `to_coin_name` (`to_coin_name`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='交易对';

--
-- 转存表中的数据 `ss_pairs`
--

INSERT INTO `ss_pairs` (`id`, `platform`, `in_contract`, `from_address`, `from_coin_name`, `from_coin_decimals`, `to_address`, `to_coin_name`, `to_coin_decimals`, `pair_address`) VALUES
(1, '0xca143ce32fe78f1f7019d7d551a6402fc5350c73', 1, '0x7130d2a12b9bcbfae4f2634d864a1ee1ce3ead9c', 'BTC', 18, '0xbb4cdb9cbd36b01bd1cbaebf2de08d9173bc095c', 'BNB', 18, '0x61eb789d75a95caa3ff50ed7e47b96c132fec082'),
(2, '0xca143ce32fe78f1f7019d7d551a6402fc5350c73', 1, '0x55d398326f99059ff775485246999027b3197955', 'USDT', 18, '0xbb4cdb9cbd36b01bd1cbaebf2de08d9173bc095c', 'BNB', 18, '0x16b9a82891338f9ba80e2d6970fdda79d1eb0dae'),
(3, '0xca143ce32fe78f1f7019d7d551a6402fc5350c73', 1, '0x2170ed0880ac9a755fd29b2688956bd959f933f8', 'ETH', 18, '0x55d398326f99059ff775485246999027b3197955', 'USDT', 18, '0x531febfeb9a61d948c384acfbe6dcc51057aea7e'),
(4, '0xca143ce32fe78f1f7019d7d551a6402fc5350c73', 0, '0xbb4cdb9cbd36b01bd1cbaebf2de08d9173bc095c', 'BNB', 18, '0x7130d2a12b9bcbfae4f2634d864a1ee1ce3ead9c', 'BTC', 18, '0x61eb789d75a95caa3ff50ed7e47b96c132fec082'),
(5, '0xca143ce32fe78f1f7019d7d551a6402fc5350c73', 0, '0xbb4cdb9cbd36b01bd1cbaebf2de08d9173bc095c', 'BNB', 18, '0x55d398326f99059ff775485246999027b3197955', 'USDT', 18, '0x16b9a82891338f9ba80e2d6970fdda79d1eb0dae'),
(6, '0xca143ce32fe78f1f7019d7d551a6402fc5350c73', 0, '0x55d398326f99059ff775485246999027b3197955', 'USDT', 18, '0x2170ed0880ac9a755fd29b2688956bd959f933f8', 'ETH', 18, '0x531febfeb9a61d948c384acfbe6dcc51057aea7e');

-- --------------------------------------------------------

--
-- 表的结构 `ss_placard`
--

CREATE TABLE IF NOT EXISTS `ss_placard` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '公告ID',
  `title` char(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '标题',
  `create_time` int NOT NULL DEFAULT '0' COMMENT '创建时间',
  `public_time` int NOT NULL DEFAULT '0' COMMENT '发布时间',
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '内容',
  `status` tinyint NOT NULL DEFAULT '0' COMMENT '状态 0 未发布 1 已发布',
  `is_del` tinyint NOT NULL DEFAULT '0' COMMENT '0 正常 1 已删除',
  PRIMARY KEY (`id`),
  KEY `status` (`status`)
) ENGINE=InnoDB AUTO_INCREMENT=60 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='公告';

--
-- 转存表中的数据 `ss_placard`
--

INSERT INTO `ss_placard` (`id`, `title`, `create_time`, `public_time`, `content`, `status`, `is_del`) VALUES
(1, 'JS(去掉前后空格或去掉所有空格)的用法', 1674728687, 1674728586, '<p style=\"text-align:justify;text-indent:2em;\">在使用 js 处理字符串时，难免会在字符串的头部或未尾留有一些空格，如果这些头部或尾部的空格没有实际的用处的话，我们就要想方设法的把他们去掉，以免他影响到正常的字符串。</p><p style=\"text-align:justify;text-indent:2em;\">关于 JS 去掉字符串头部和尾部的空格有很多种方法，下面飞鸟慕鱼就来简单的说几种。</p>', 0, 0),
(2, '升空起飞！他们在战位度新春', 1674728795, 1674728778, '<p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">寒潮涌动，砺兵火热</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">春节来临之际</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">东部战区空军航空兵某团机场上</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">战机列阵，铁翼掠空</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">多个训练课目同场展开——</p>', 0, 0),
(3, '中国传统色打开锦绣山河', 1674728894, 1674728804, '<p>一、春暖花开，用传统色打开锦绣山河<br/></p><p><br/>春暖花开，万物复苏。此时此刻，我们可以用中国传统的五颜六色来打开锦绣山河，感受大好河山的壮丽。从海上看，五彩斑斓的海市蜃楼在海浪中闪耀；从山上看，金黄的小麦地里有一片片的碧绿；从田野看，五彩斑斓的水库里有一片片的彩云。这些都是中国传统色彩带来的壮丽。</p>', 0, 0),
(4, '兔年新春中国消费市场加速回暖', 1674728926, 1674728896, '<p style=\"text-align:left;text-indent:2em;\">时隔两年，在广州工作的长沙市民张先生踏上期盼已久的回家过年旅途。出站后的第一件事就是“打卡”家乡奶茶品牌茶颜悦色。</p><p style=\"text-align:left;text-indent:2em;\">在店员的推荐下，他买了冬季新品“三层被”，开心地发了朋友圈：“回家了！目标：好好陪家人，吃遍家乡美食。”</p><p style=\"text-align:left;text-indent:2em;\">“门店客流量和平时相比翻倍增长。”茶颜悦色高铁南站店店长陈坤和他一样开心。</p><p style=\"text-align:left;text-indent:2em;\">今年春节是中国疫情防控进入新阶段后的首个春节。春节“返乡潮”叠加各地出台的刺激消费政策，使得兔年春节的旅游、消费市场更为火热。</p>', 0, 0),
(5, '明年再见!充电器一拔我和浪浪山道别了引热议 专家建议春节...', 1674728982, 1674728963, '<p style=\"text-align:start;text-indent:2em;\">一眨眼春节就快过完了，大家收拾好行囊，又踏上了离家返程的旅途，酒没喝尽，话没说完，许多事情还没做，很多人还没有好好告别，纵使万般不舍，泪在心田，充电器一拔，再见又是新的一年。</p><p style=\"text-align:start;text-indent:2em;\">这也引发了网友的热议，有网友表示，不是我说，春节假期是真的太短了，七天时间，对于长途的人来说，收尾路上就要去掉两天，一共只有五天啊。</p><p style=\"text-align:start;text-indent:2em;\">也有网友表示，看得人好难受，下一个节假日什么时候？清明端午吗，好想多陪陪父母啊。新年假期即将结束，万般不舍也得离开。</p>', 0, 0),
(6, 'JS(去掉前后空格或去掉所有空格)的用法', 1674728687, 1674728586, '<p style=\"text-align:justify;text-indent:2em;\">在使用 js 处理字符串时，难免会在字符串的头部或未尾留有一些空格，如果这些头部或尾部的空格没有实际的用处的话，我们就要想方设法的把他们去掉，以免他影响到正常的字符串。</p><p style=\"text-align:justify;text-indent:2em;\">关于 JS 去掉字符串头部和尾部的空格有很多种方法，下面飞鸟慕鱼就来简单的说几种。</p>', 0, 0),
(7, '升空起飞！他们在战位度新春', 1674728795, 1674728778, '<p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">寒潮涌动，砺兵火热</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">春节来临之际</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">东部战区空军航空兵某团机场上</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">战机列阵，铁翼掠空</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">多个训练课目同场展开——</p>', 0, 0),
(8, '中国传统色打开锦绣山河', 1674728894, 1674728804, '<p>一、春暖花开，用传统色打开锦绣山河<br/></p><p><br/>春暖花开，万物复苏。此时此刻，我们可以用中国传统的五颜六色来打开锦绣山河，感受大好河山的壮丽。从海上看，五彩斑斓的海市蜃楼在海浪中闪耀；从山上看，金黄的小麦地里有一片片的碧绿；从田野看，五彩斑斓的水库里有一片片的彩云。这些都是中国传统色彩带来的壮丽。</p>', 0, 0),
(9, '兔年新春中国消费市场加速回暖', 1674728926, 1674728896, '<p style=\"text-align:left;text-indent:2em;\">时隔两年，在广州工作的长沙市民张先生踏上期盼已久的回家过年旅途。出站后的第一件事就是“打卡”家乡奶茶品牌茶颜悦色。</p><p style=\"text-align:left;text-indent:2em;\">在店员的推荐下，他买了冬季新品“三层被”，开心地发了朋友圈：“回家了！目标：好好陪家人，吃遍家乡美食。”</p><p style=\"text-align:left;text-indent:2em;\">“门店客流量和平时相比翻倍增长。”茶颜悦色高铁南站店店长陈坤和他一样开心。</p><p style=\"text-align:left;text-indent:2em;\">今年春节是中国疫情防控进入新阶段后的首个春节。春节“返乡潮”叠加各地出台的刺激消费政策，使得兔年春节的旅游、消费市场更为火热。</p>', 0, 0),
(10, '明年再见!充电器一拔我和浪浪山道别了引热议 专家建议春节...', 1674728982, 1674728963, '<p style=\"text-align:start;text-indent:2em;\">一眨眼春节就快过完了，大家收拾好行囊，又踏上了离家返程的旅途，酒没喝尽，话没说完，许多事情还没做，很多人还没有好好告别，纵使万般不舍，泪在心田，充电器一拔，再见又是新的一年。</p><p style=\"text-align:start;text-indent:2em;\">这也引发了网友的热议，有网友表示，不是我说，春节假期是真的太短了，七天时间，对于长途的人来说，收尾路上就要去掉两天，一共只有五天啊。</p><p style=\"text-align:start;text-indent:2em;\">也有网友表示，看得人好难受，下一个节假日什么时候？清明端午吗，好想多陪陪父母啊。新年假期即将结束，万般不舍也得离开。</p>', 0, 0),
(13, 'JS(去掉前后空格或去掉所有空格)的用法', 1674728687, 1674728586, '<p style=\"text-align:justify;text-indent:2em;\">在使用 js 处理字符串时，难免会在字符串的头部或未尾留有一些空格，如果这些头部或尾部的空格没有实际的用处的话，我们就要想方设法的把他们去掉，以免他影响到正常的字符串。</p><p style=\"text-align:justify;text-indent:2em;\">关于 JS 去掉字符串头部和尾部的空格有很多种方法，下面飞鸟慕鱼就来简单的说几种。</p>', 0, 0),
(14, '升空起飞！他们在战位度新春', 1674728795, 1674728778, '<p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">寒潮涌动，砺兵火热</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">春节来临之际</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">东部战区空军航空兵某团机场上</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">战机列阵，铁翼掠空</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">多个训练课目同场展开——</p>', 0, 0),
(15, '中国传统色打开锦绣山河', 1674728894, 1674728804, '<p>一、春暖花开，用传统色打开锦绣山河<br/></p><p><br/>春暖花开，万物复苏。此时此刻，我们可以用中国传统的五颜六色来打开锦绣山河，感受大好河山的壮丽。从海上看，五彩斑斓的海市蜃楼在海浪中闪耀；从山上看，金黄的小麦地里有一片片的碧绿；从田野看，五彩斑斓的水库里有一片片的彩云。这些都是中国传统色彩带来的壮丽。</p>', 0, 0),
(16, '兔年新春中国消费市场加速回暖', 1674728926, 1674728896, '<p style=\"text-align:left;text-indent:2em;\">时隔两年，在广州工作的长沙市民张先生踏上期盼已久的回家过年旅途。出站后的第一件事就是“打卡”家乡奶茶品牌茶颜悦色。</p><p style=\"text-align:left;text-indent:2em;\">在店员的推荐下，他买了冬季新品“三层被”，开心地发了朋友圈：“回家了！目标：好好陪家人，吃遍家乡美食。”</p><p style=\"text-align:left;text-indent:2em;\">“门店客流量和平时相比翻倍增长。”茶颜悦色高铁南站店店长陈坤和他一样开心。</p><p style=\"text-align:left;text-indent:2em;\">今年春节是中国疫情防控进入新阶段后的首个春节。春节“返乡潮”叠加各地出台的刺激消费政策，使得兔年春节的旅游、消费市场更为火热。</p>', 0, 0),
(17, '明年再见!充电器一拔我和浪浪山道别了引热议 专家建议春节...', 1674728982, 1674728963, '<p style=\"text-align:start;text-indent:2em;\">一眨眼春节就快过完了，大家收拾好行囊，又踏上了离家返程的旅途，酒没喝尽，话没说完，许多事情还没做，很多人还没有好好告别，纵使万般不舍，泪在心田，充电器一拔，再见又是新的一年。</p><p style=\"text-align:start;text-indent:2em;\">这也引发了网友的热议，有网友表示，不是我说，春节假期是真的太短了，七天时间，对于长途的人来说，收尾路上就要去掉两天，一共只有五天啊。</p><p style=\"text-align:start;text-indent:2em;\">也有网友表示，看得人好难受，下一个节假日什么时候？清明端午吗，好想多陪陪父母啊。新年假期即将结束，万般不舍也得离开。</p>', 0, 0),
(18, 'JS(去掉前后空格或去掉所有空格)的用法', 1674728687, 1674728586, '<p style=\"text-align:justify;text-indent:2em;\">在使用 js 处理字符串时，难免会在字符串的头部或未尾留有一些空格，如果这些头部或尾部的空格没有实际的用处的话，我们就要想方设法的把他们去掉，以免他影响到正常的字符串。</p><p style=\"text-align:justify;text-indent:2em;\">关于 JS 去掉字符串头部和尾部的空格有很多种方法，下面飞鸟慕鱼就来简单的说几种。</p>', 0, 0),
(19, '升空起飞！他们在战位度新春', 1674728795, 1674728778, '<p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">寒潮涌动，砺兵火热</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">春节来临之际</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">东部战区空军航空兵某团机场上</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">战机列阵，铁翼掠空</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">多个训练课目同场展开——</p>', 0, 0),
(20, '中国传统色打开锦绣山河', 1674728894, 1674728804, '<p>一、春暖花开，用传统色打开锦绣山河<br/></p><p><br/>春暖花开，万物复苏。此时此刻，我们可以用中国传统的五颜六色来打开锦绣山河，感受大好河山的壮丽。从海上看，五彩斑斓的海市蜃楼在海浪中闪耀；从山上看，金黄的小麦地里有一片片的碧绿；从田野看，五彩斑斓的水库里有一片片的彩云。这些都是中国传统色彩带来的壮丽。</p>', 0, 0),
(21, '兔年新春中国消费市场加速回暖', 1674728926, 1674728896, '<p style=\"text-align:left;text-indent:2em;\">时隔两年，在广州工作的长沙市民张先生踏上期盼已久的回家过年旅途。出站后的第一件事就是“打卡”家乡奶茶品牌茶颜悦色。</p><p style=\"text-align:left;text-indent:2em;\">在店员的推荐下，他买了冬季新品“三层被”，开心地发了朋友圈：“回家了！目标：好好陪家人，吃遍家乡美食。”</p><p style=\"text-align:left;text-indent:2em;\">“门店客流量和平时相比翻倍增长。”茶颜悦色高铁南站店店长陈坤和他一样开心。</p><p style=\"text-align:left;text-indent:2em;\">今年春节是中国疫情防控进入新阶段后的首个春节。春节“返乡潮”叠加各地出台的刺激消费政策，使得兔年春节的旅游、消费市场更为火热。</p>', 0, 0),
(22, '明年再见!充电器一拔我和浪浪山道别了引热议 专家建议春节...', 1674728982, 1674728963, '<p style=\"text-align:start;text-indent:2em;\">一眨眼春节就快过完了，大家收拾好行囊，又踏上了离家返程的旅途，酒没喝尽，话没说完，许多事情还没做，很多人还没有好好告别，纵使万般不舍，泪在心田，充电器一拔，再见又是新的一年。</p><p style=\"text-align:start;text-indent:2em;\">这也引发了网友的热议，有网友表示，不是我说，春节假期是真的太短了，七天时间，对于长途的人来说，收尾路上就要去掉两天，一共只有五天啊。</p><p style=\"text-align:start;text-indent:2em;\">也有网友表示，看得人好难受，下一个节假日什么时候？清明端午吗，好想多陪陪父母啊。新年假期即将结束，万般不舍也得离开。</p>', 0, 0),
(28, 'JS(去掉前后空格或去掉所有空格)的用法', 1674728687, 1674728586, '<p style=\"text-align:justify;text-indent:2em;\">在使用 js 处理字符串时，难免会在字符串的头部或未尾留有一些空格，如果这些头部或尾部的空格没有实际的用处的话，我们就要想方设法的把他们去掉，以免他影响到正常的字符串。</p><p style=\"text-align:justify;text-indent:2em;\">关于 JS 去掉字符串头部和尾部的空格有很多种方法，下面飞鸟慕鱼就来简单的说几种。</p>', 1, 0),
(29, '升空起飞！他们在战位度新春', 1674728795, 1674728778, '<p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">寒潮涌动，砺兵火热</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">春节来临之际</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">东部战区空军航空兵某团机场上</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">战机列阵，铁翼掠空</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">多个训练课目同场展开——</p>', 1, 0),
(30, '中国传统色打开锦绣山河', 1674728894, 1674728804, '<p>一、春暖花开，用传统色打开锦绣山河<br/></p><p><br/>春暖花开，万物复苏。此时此刻，我们可以用中国传统的五颜六色来打开锦绣山河，感受大好河山的壮丽。从海上看，五彩斑斓的海市蜃楼在海浪中闪耀；从山上看，金黄的小麦地里有一片片的碧绿；从田野看，五彩斑斓的水库里有一片片的彩云。这些都是中国传统色彩带来的壮丽。</p>', 1, 0),
(31, '兔年新春中国消费市场加速回暖', 1674728926, 1674728896, '<p style=\"text-align:left;text-indent:2em;\">时隔两年，在广州工作的长沙市民张先生踏上期盼已久的回家过年旅途。出站后的第一件事就是“打卡”家乡奶茶品牌茶颜悦色。</p><p style=\"text-align:left;text-indent:2em;\">在店员的推荐下，他买了冬季新品“三层被”，开心地发了朋友圈：“回家了！目标：好好陪家人，吃遍家乡美食。”</p><p style=\"text-align:left;text-indent:2em;\">“门店客流量和平时相比翻倍增长。”茶颜悦色高铁南站店店长陈坤和他一样开心。</p><p style=\"text-align:left;text-indent:2em;\">今年春节是中国疫情防控进入新阶段后的首个春节。春节“返乡潮”叠加各地出台的刺激消费政策，使得兔年春节的旅游、消费市场更为火热。</p>', 1, 0),
(32, '明年再见!充电器一拔我和浪浪山道别了引热议 专家建议春节...', 1674728982, 1674728963, '<p style=\"text-align:start;text-indent:2em;\">一眨眼春节就快过完了，大家收拾好行囊，又踏上了离家返程的旅途，酒没喝尽，话没说完，许多事情还没做，很多人还没有好好告别，纵使万般不舍，泪在心田，充电器一拔，再见又是新的一年。</p><p style=\"text-align:start;text-indent:2em;\">这也引发了网友的热议，有网友表示，不是我说，春节假期是真的太短了，七天时间，对于长途的人来说，收尾路上就要去掉两天，一共只有五天啊。</p><p style=\"text-align:start;text-indent:2em;\">也有网友表示，看得人好难受，下一个节假日什么时候？清明端午吗，好想多陪陪父母啊。新年假期即将结束，万般不舍也得离开。</p>', 1, 0),
(33, 'JS(去掉前后空格或去掉所有空格)的用法', 1674728687, 1674728586, '<p style=\"text-align:justify;text-indent:2em;\">在使用 js 处理字符串时，难免会在字符串的头部或未尾留有一些空格，如果这些头部或尾部的空格没有实际的用处的话，我们就要想方设法的把他们去掉，以免他影响到正常的字符串。</p><p style=\"text-align:justify;text-indent:2em;\">关于 JS 去掉字符串头部和尾部的空格有很多种方法，下面飞鸟慕鱼就来简单的说几种。</p>', 1, 0),
(34, '升空起飞！他们在战位度新春', 1674728795, 1674728778, '<p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">寒潮涌动，砺兵火热</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">春节来临之际</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">东部战区空军航空兵某团机场上</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">战机列阵，铁翼掠空</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">多个训练课目同场展开——</p>', 1, 0),
(35, '中国传统色打开锦绣山河', 1674728894, 1674728804, '<p>一、春暖花开，用传统色打开锦绣山河<br/></p><p><br/>春暖花开，万物复苏。此时此刻，我们可以用中国传统的五颜六色来打开锦绣山河，感受大好河山的壮丽。从海上看，五彩斑斓的海市蜃楼在海浪中闪耀；从山上看，金黄的小麦地里有一片片的碧绿；从田野看，五彩斑斓的水库里有一片片的彩云。这些都是中国传统色彩带来的壮丽。</p>', 1, 0),
(36, '兔年新春中国消费市场加速回暖', 1674728926, 1674728896, '<p style=\"text-align:left;text-indent:2em;\">时隔两年，在广州工作的长沙市民张先生踏上期盼已久的回家过年旅途。出站后的第一件事就是“打卡”家乡奶茶品牌茶颜悦色。</p><p style=\"text-align:left;text-indent:2em;\">在店员的推荐下，他买了冬季新品“三层被”，开心地发了朋友圈：“回家了！目标：好好陪家人，吃遍家乡美食。”</p><p style=\"text-align:left;text-indent:2em;\">“门店客流量和平时相比翻倍增长。”茶颜悦色高铁南站店店长陈坤和他一样开心。</p><p style=\"text-align:left;text-indent:2em;\">今年春节是中国疫情防控进入新阶段后的首个春节。春节“返乡潮”叠加各地出台的刺激消费政策，使得兔年春节的旅游、消费市场更为火热。</p>', 1, 0),
(37, '明年再见!充电器一拔我和浪浪山道别了引热议 专家建议春节...', 1674728982, 1674728963, '<p style=\"text-align:start;text-indent:2em;\">一眨眼春节就快过完了，大家收拾好行囊，又踏上了离家返程的旅途，酒没喝尽，话没说完，许多事情还没做，很多人还没有好好告别，纵使万般不舍，泪在心田，充电器一拔，再见又是新的一年。</p><p style=\"text-align:start;text-indent:2em;\">这也引发了网友的热议，有网友表示，不是我说，春节假期是真的太短了，七天时间，对于长途的人来说，收尾路上就要去掉两天，一共只有五天啊。</p><p style=\"text-align:start;text-indent:2em;\">也有网友表示，看得人好难受，下一个节假日什么时候？清明端午吗，好想多陪陪父母啊。新年假期即将结束，万般不舍也得离开。</p>', 1, 0),
(38, 'JS(去掉前后空格或去掉所有空格)的用法', 1674728687, 1674728586, '<p style=\"text-align:justify;text-indent:2em;\">在使用 js 处理字符串时，难免会在字符串的头部或未尾留有一些空格，如果这些头部或尾部的空格没有实际的用处的话，我们就要想方设法的把他们去掉，以免他影响到正常的字符串。</p><p style=\"text-align:justify;text-indent:2em;\">关于 JS 去掉字符串头部和尾部的空格有很多种方法，下面飞鸟慕鱼就来简单的说几种。</p>', 1, 0),
(39, '升空起飞！他们在战位度新春', 1674728795, 1674728778, '<p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">寒潮涌动，砺兵火热</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">春节来临之际</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">东部战区空军航空兵某团机场上</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">战机列阵，铁翼掠空</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">多个训练课目同场展开——</p>', 1, 0),
(40, '中国传统色打开锦绣山河', 1674728894, 1674728804, '<p>一、春暖花开，用传统色打开锦绣山河<br/></p><p><br/>春暖花开，万物复苏。此时此刻，我们可以用中国传统的五颜六色来打开锦绣山河，感受大好河山的壮丽。从海上看，五彩斑斓的海市蜃楼在海浪中闪耀；从山上看，金黄的小麦地里有一片片的碧绿；从田野看，五彩斑斓的水库里有一片片的彩云。这些都是中国传统色彩带来的壮丽。</p>', 1, 0),
(41, '兔年新春中国消费市场加速回暖', 1674728926, 1674728896, '<p style=\"text-align:left;text-indent:2em;\">时隔两年，在广州工作的长沙市民张先生踏上期盼已久的回家过年旅途。出站后的第一件事就是“打卡”家乡奶茶品牌茶颜悦色。</p><p style=\"text-align:left;text-indent:2em;\">在店员的推荐下，他买了冬季新品“三层被”，开心地发了朋友圈：“回家了！目标：好好陪家人，吃遍家乡美食。”</p><p style=\"text-align:left;text-indent:2em;\">“门店客流量和平时相比翻倍增长。”茶颜悦色高铁南站店店长陈坤和他一样开心。</p><p style=\"text-align:left;text-indent:2em;\">今年春节是中国疫情防控进入新阶段后的首个春节。春节“返乡潮”叠加各地出台的刺激消费政策，使得兔年春节的旅游、消费市场更为火热。</p>', 1, 0),
(42, '明年再见!充电器一拔我和浪浪山道别了引热议 专家建议春节...', 1674728982, 1674728963, '<p style=\"text-align:start;text-indent:2em;\">一眨眼春节就快过完了，大家收拾好行囊，又踏上了离家返程的旅途，酒没喝尽，话没说完，许多事情还没做，很多人还没有好好告别，纵使万般不舍，泪在心田，充电器一拔，再见又是新的一年。</p><p style=\"text-align:start;text-indent:2em;\">这也引发了网友的热议，有网友表示，不是我说，春节假期是真的太短了，七天时间，对于长途的人来说，收尾路上就要去掉两天，一共只有五天啊。</p><p style=\"text-align:start;text-indent:2em;\">也有网友表示，看得人好难受，下一个节假日什么时候？清明端午吗，好想多陪陪父母啊。新年假期即将结束，万般不舍也得离开。</p>', 1, 0),
(43, 'JS(去掉前后空格或去掉所有空格)的用法', 1674728687, 1674728586, '<p style=\"text-align:justify;text-indent:2em;\">在使用 js 处理字符串时，难免会在字符串的头部或未尾留有一些空格，如果这些头部或尾部的空格没有实际的用处的话，我们就要想方设法的把他们去掉，以免他影响到正常的字符串。</p><p style=\"text-align:justify;text-indent:2em;\">关于 JS 去掉字符串头部和尾部的空格有很多种方法，下面飞鸟慕鱼就来简单的说几种。</p>', 1, 0),
(44, '升空起飞！他们在战位度新春', 1674728795, 1674728778, '<p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">寒潮涌动，砺兵火热</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">春节来临之际</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">东部战区空军航空兵某团机场上</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">战机列阵，铁翼掠空</p><p style=\"text-align:justify;text-indent:2em;\" class=\"art_p\" cms-style=\"font-L\">多个训练课目同场展开——</p>', 1, 0),
(45, '中国传统色打开锦绣山河', 1674728894, 1674728804, '<p>一、春暖花开，用传统色打开锦绣山河<br/></p><p><br/>春暖花开，万物复苏。此时此刻，我们可以用中国传统的五颜六色来打开锦绣山河，感受大好河山的壮丽。从海上看，五彩斑斓的海市蜃楼在海浪中闪耀；从山上看，金黄的小麦地里有一片片的碧绿；从田野看，五彩斑斓的水库里有一片片的彩云。这些都是中国传统色彩带来的壮丽。</p>', 1, 0),
(46, '兔年新春中国消费市场加速回暖', 1674728926, 1674728896, '<p style=\"text-align:left;text-indent:2em;\">时隔两年，在广州工作的长沙市民张先生踏上期盼已久的回家过年旅途。出站后的第一件事就是“打卡”家乡奶茶品牌茶颜悦色。</p><p style=\"text-align:left;text-indent:2em;\">在店员的推荐下，他买了冬季新品“三层被”，开心地发了朋友圈：“回家了！目标：好好陪家人，吃遍家乡美食。”</p><p style=\"text-align:left;text-indent:2em;\">“门店客流量和平时相比翻倍增长。”茶颜悦色高铁南站店店长陈坤和他一样开心。</p><p style=\"text-align:left;text-indent:2em;\">今年春节是中国疫情防控进入新阶段后的首个春节。春节“返乡潮”叠加各地出台的刺激消费政策，使得兔年春节的旅游、消费市场更为火热。</p>', 1, 0),
(47, '明年再见!充电器一拔我和浪浪山道别了引热议 专家建议春节...', 1674728982, 1674728963, '<p style=\"text-align:start;text-indent:2em;\">一眨眼春节就快过完了，大家收拾好行囊，又踏上了离家返程的旅途，酒没喝尽，话没说完，许多事情还没做，很多人还没有好好告别，纵使万般不舍，泪在心田，充电器一拔，再见又是新的一年。</p><p style=\"text-align:start;text-indent:2em;\">这也引发了网友的热议，有网友表示，不是我说，春节假期是真的太短了，七天时间，对于长途的人来说，收尾路上就要去掉两天，一共只有五天啊。</p><p style=\"text-align:start;text-indent:2em;\">也有网友表示，看得人好难受，下一个节假日什么时候？清明端午吗，好想多陪陪父母啊。新年假期即将结束，万般不舍也得离开。</p>', 1, 0),
(59, '测试11', 1674746698, 1674746680, '<p>测试文本111</p>', 0, 1);

-- --------------------------------------------------------

--
-- 表的结构 `ss_recharge`
--

CREATE TABLE IF NOT EXISTS `ss_recharge` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '充值id',
  `account_id` int NOT NULL DEFAULT '0' COMMENT '充值帐户ID',
  `rechange_type` char(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'USDT' COMMENT '充值币种',
  `transaction_hash` char(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '0x0000000000000000000000000000000000000000000000000000000000000000' COMMENT '交易hash',
  `recharge_count` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT '充值数量',
  `recharge_time` int NOT NULL DEFAULT '0' COMMENT '充值时间',
  `from_address` char(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '0x0000000000000000000000000000000000000000' COMMENT '充值地址',
  `to_address` char(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '0x0000000000000000000000000000000000000000' COMMENT '到账地址',
  `status` tinyint NOT NULL DEFAULT '0' COMMENT '充值状态 0:已提交申请 1:确认 -1:拒绝',
  `check_account` char(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '确认帐户',
  `check_time` int NOT NULL DEFAULT '0' COMMENT '确认时间',
  PRIMARY KEY (`id`),
  KEY `status` (`status`)
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='充值申请';

--
-- 转存表中的数据 `ss_recharge`
--

INSERT INTO `ss_recharge` (`id`, `account_id`, `rechange_type`, `transaction_hash`, `recharge_count`, `recharge_time`, `from_address`, `to_address`, `status`, `check_account`, `check_time`) VALUES
(1, 1, '', '0xe32e3b534ff46f0e878d456c526ea4b5ef1789322a0bbb58516b7c30ced75453', '0.000000000000000000', 1674247072, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399936),
(2, 2, '', '0x041191d6772b0094a2181772591b307e29a9ba2dec2e61de54f1cbf87a64d992', '0.000000000000000000', 1674247131, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674413258),
(3, 3, '', '0x7defe3502227163642a2e09942e5184c172faed509773306951bc2d56caa0270', '0.000000000000000000', 1674247154, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674413253),
(4, 4, 'BTC', '0x3ecd9b82998b360b73a3e2dc8488b6ba1280f78ce126e75f4a269ebd7afeed57', '0.001000000000000000', 1674247174, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', '0x500b7d80d4f74786a922bed4d23e47333e6c7728', 1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674411960),
(5, 5, '', '0x7aa1850d4115d0713bfbd35f8db0739b67d729f9e18059bf7f30dea32899628a', '0.000000000000000000', 1674247197, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674400904),
(6, 29, '', '0xfd42c91ef9d83c73fe735f7e35e7d410f47c06895c0d1231c38a421ab82ad119', '0.000000000000000000', 1674247496, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674400699),
(7, 6, '', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b90', '0.000000000000000000', 1674249025, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674400588),
(8, 7, '', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b91', '0.000000000000000000', 1674249035, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674400492),
(9, 8, '', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b92', '0.000000000000000000', 1674249044, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674400094),
(10, 9, '', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b93', '0.000000000000000000', 1674249053, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399912),
(11, 11, '', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b94', '0.000000000000000000', 1674249320, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399855),
(12, 12, '', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b95', '0.000000000000000000', 1674249336, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399830),
(13, 13, '', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b96', '0.000000000000000000', 1674249346, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399794),
(14, 14, '', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b97', '0.000000000000000000', 1674249356, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399791),
(15, 15, '', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b98', '0.000000000000000000', 1674249370, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399783),
(16, 16, '', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b99', '0.000000000000000000', 1674249385, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399777),
(17, 17, 'USDT', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b9a', '1000.000000000000000000', 1674249399, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', '0x500b7d80d4f74786a922bed4d23e47333e6c7728', 1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399773),
(18, 18, 'USDT', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b9b', '1000.000000000000000000', 1674249410, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', '0x500b7d80d4f74786a922bed4d23e47333e6c7728', 1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399769),
(19, 19, 'USDT', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b9c', '100.000000000000000000', 1674249683, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', '0x500b7d80d4f74786a922bed4d23e47333e6c7728', 1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399763),
(20, 20, 'BTC', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b9d', '10.000000000000000000', 1674249702, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', '0x500b7d80d4f74786a922bed4d23e47333e6c7728', 1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399728),
(21, 21, 'ETH', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b9e', '10.000000000000000000', 1674249712, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', '0x500b7d80d4f74786a922bed4d23e47333e6c7728', 1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674399482),
(22, 1, '', '0xb842141cc5e44d871dfa5e7552e3fb0783193883db98b75738d2227132050b99', '0.000000000000000000', 1674485772, '', '', -1, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674485784),
(23, 1, '', '0xb353a5684fae32757be5a25816456b8948256206b77d32eb6a81b88397e59904', '0.000000000000000000', 1674874144, '', '', 0, '', 0);

-- --------------------------------------------------------

--
-- 表的结构 `ss_register_code`
--

CREATE TABLE IF NOT EXISTS `ss_register_code` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT 'id',
  `account` char(80) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '0' COMMENT '账号',
  `code` char(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '注册码',
  `send_time` int NOT NULL DEFAULT '0' COMMENT '发送时间',
  `expired` int NOT NULL DEFAULT '0' COMMENT '过期时间',
  `status` tinyint NOT NULL DEFAULT '0' COMMENT '是否使用0 未使用 1已使用',
  PRIMARY KEY (`id`),
  KEY `account` (`account`),
  KEY `status` (`status`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='注册码';

--
-- 转存表中的数据 `ss_register_code`
--

INSERT INTO `ss_register_code` (`id`, `account`, `code`, `send_time`, `expired`, `status`) VALUES
(1, 'haha@yeah.net', '576145', 1674818915, 1674819215, 1),
(4, 'chen_shengda@yeah.net', '314828', 1676384594, 1676384894, 0);

-- --------------------------------------------------------

--
-- 表的结构 `ss_swap`
--

CREATE TABLE IF NOT EXISTS `ss_swap` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '兑换ID',
  `create_time` int NOT NULL DEFAULT '0' COMMENT '创建时间',
  `account` int NOT NULL DEFAULT '0' COMMENT '帐户id',
  `from_coin_type` char(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'ICP' COMMENT '转出币种',
  `from_coin_count` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT '转出币种数量',
  `from_coin_price` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT '转出币种价格',
  `to_coin_type` char(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'USDT' COMMENT '兑换币种',
  `to_coin_count` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT '转入币种数量',
  `to_coin_price` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT '转入币种价格',
  PRIMARY KEY (`id`),
  KEY `account` (`account`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='兑换表';

--
-- 转存表中的数据 `ss_swap`
--

INSERT INTO `ss_swap` (`id`, `create_time`, `account`, `from_coin_type`, `from_coin_count`, `from_coin_price`, `to_coin_type`, `to_coin_count`, `to_coin_price`) VALUES
(1, 1674675715, 1, 'USDT', '0.100000000000000000', '1.000000000000000000', 'ICP', '0.051480000000000000', '1.942500000000000000'),
(2, 1674675864, 1, 'ICP', '100.000000000000000000', '1.942500000000000000', 'BTC', '0.008553000000000000', '22709.010000000000000000'),
(3, 1674676062, 1, 'USDT', '100.000000000000000000', '1.000000000000000000', 'ICP', '51.480051000000000000', '1.942500000000000000'),
(4, 1674676066, 1, 'USDT', '100.000000000000000000', '1.000000000000000000', 'ICP', '51.480051000000000000', '1.942500000000000000'),
(5, 1674676069, 1, 'USDT', '100.000000000000000000', '1.000000000000000000', 'ICP', '51.480051000000000000', '1.942500000000000000'),
(6, 1674676070, 1, 'USDT', '100.000000000000000000', '1.000000000000000000', 'ICP', '51.480051000000000000', '1.942500000000000000'),
(7, 1674676090, 1, 'ICP', '1000.000000000000000000', '1.942500000000000000', 'BTC', '0.085581000000000000', '22697.590000000000000000'),
(8, 1674676092, 1, 'ICP', '1000.000000000000000000', '1.942500000000000000', 'BTC', '0.085581000000000000', '22697.590000000000000000'),
(9, 1674676093, 1, 'ICP', '1000.000000000000000000', '1.942500000000000000', 'BTC', '0.085581000000000000', '22697.590000000000000000'),
(10, 1674676094, 1, 'ICP', '1000.000000000000000000', '1.942500000000000000', 'BTC', '0.085581000000000000', '22697.590000000000000000'),
(11, 1674676177, 1, 'ICP', '100.000000000000000000', '1.942500000000000000', 'BTC', '0.008552000000000000', '22712.140000000000000000'),
(12, 1674676229, 1, 'ICP', '1000.000000000000000000', '1.942500000000000000', 'BTC', '0.085561000000000000', '22702.970000000000000000'),
(13, 1674676230, 1, 'ICP', '1000.000000000000000000', '1.942500000000000000', 'BTC', '0.085561000000000000', '22702.970000000000000000'),
(14, 1674676231, 1, 'ICP', '1000.000000000000000000', '1.942500000000000000', 'BTC', '0.085561000000000000', '22702.970000000000000000'),
(15, 1674676232, 1, 'ICP', '1000.000000000000000000', '1.942500000000000000', 'BTC', '0.085561000000000000', '22702.970000000000000000'),
(16, 1674676233, 1, 'ICP', '1000.000000000000000000', '1.942500000000000000', 'BTC', '0.085561000000000000', '22702.970000000000000000'),
(17, 1674676234, 1, 'ICP', '1000.000000000000000000', '1.942500000000000000', 'BTC', '0.085561000000000000', '22702.970000000000000000'),
(18, 1674676328, 1, 'ICP', '100.000000000000000000', '1.942500000000000000', 'BTC', '0.008557000000000000', '22699.230000000000000000'),
(19, 1674676331, 1, 'ICP', '100.000000000000000000', '1.942500000000000000', 'BTC', '0.008557000000000000', '22699.230000000000000000'),
(20, 1674676332, 1, 'ICP', '100.000000000000000000', '1.942500000000000000', 'BTC', '0.008557000000000000', '22699.230000000000000000'),
(21, 1674676334, 1, 'ICP', '100.000000000000000000', '1.942500000000000000', 'BTC', '0.008557000000000000', '22699.230000000000000000'),
(22, 1674680311, 1, 'USDT', '0.100000000000000000', '1.000000000000000000', 'ICP', '0.079833000000000000', '1.252600000000000000'),
(23, 1674791372, 1, 'USDT', '0.100000000000000000', '1.000000000000000000', 'ICP', '0.065646000000000000', '1.523300000000000000'),
(24, 1674843538, 1, 'ICP', '101.111000000000000000', '1.463700000000000000', 'BTC', '0.006392000000000000', '23150.390000000000000000'),
(25, 1676293386, 1, 'ICP', '123.000000000000000000', '1.311200000000000000', 'ETH', '0.108478000000000000', '1486.718744000000000000'),
(26, 1676293528, 1, 'ICP', '123.000000000000000000', '1.311200000000000000', 'ETH', '0.108476000000000000', '1486.753309000000000000'),
(27, 1676293542, 1, 'ICP', '123.000000000000000000', '1.311200000000000000', 'BTC', '0.007446000000000000', '21658.991114000000000000'),
(28, 1676294630, 1, 'ICP', '123.000000000000000000', '1.311200000000000000', 'ETH', '0.108520000000000000', '1486.149068000000000000'),
(29, 1676378655, 1, 'ICP', '23525.000000000000000000', '1.671800000000000000', 'ETH', '25.998274000000000000', '1512.757899000000000000'),
(30, 1676452753, 1, 'ICP', '123.000000000000000000', '1.671800000000000000', 'USDT', '205.631400000000000000', '1.000000000000000000'),
(31, 1676452754, 1, 'ICP', '123.000000000000000000', '1.671800000000000000', 'USDT', '205.631400000000000000', '1.000000000000000000'),
(32, 1676452813, 1, 'ICP', '123.000000000000000000', '1.671800000000000000', 'USDT', '205.631400000000000000', '1.000000000000000000'),
(33, 1676452889, 1, 'ICP', '18.000000000000000000', '1.671800000000000000', 'USDT', '30.092400000000000000', '1.000000000000000000'),
(34, 1676452900, 1, 'ICP', '123.000000000000000000', '1.671800000000000000', 'USDT', '205.631400000000000000', '1.000000000000000000'),
(35, 1676452919, 1, 'ICP', '1.000000000000000000', '1.671800000000000000', 'USDT', '1.671800000000000000', '1.000000000000000000');

-- --------------------------------------------------------

--
-- 表的结构 `ss_user`
--

CREATE TABLE IF NOT EXISTS `ss_user` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '会员ID',
  `account` char(80) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '账户名称',
  `parent` int NOT NULL DEFAULT '0' COMMENT '推荐人',
  `prefix_password` char(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '密码前缀',
  `password` char(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '登陆密码',
  `recommend` char(8) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '推荐码',
  `path` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '推荐路径',
  `icp_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'icp余额',
  `lock_icp_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT '锁定ICP数量',
  `usdt_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'usdt余额',
  `lock_usdt_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT '锁定USDT数量',
  `eth_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'eth余额',
  `lock_eth_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT '锁定ETH数量',
  `btc_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT 'btc余额',
  `lock_btc_coin` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT '锁定BTC数量',
  `create_time` int NOT NULL DEFAULT '0' COMMENT '创建时间',
  `id_card` char(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '身份认证',
  `realname` char(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '真实名',
  `id_photo` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '证件照',
  `pass_err_time` tinyint NOT NULL DEFAULT '0' COMMENT '密码错误次数',
  `comment` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '禁用说明',
  `lock_time` int NOT NULL DEFAULT '0' COMMENT '锁定时间',
  `status` tinyint NOT NULL DEFAULT '0' COMMENT '禁用状态: 0 正常 1禁用',
  `is_del` tinyint NOT NULL DEFAULT '0' COMMENT '是否删除 0未删除 1已删除',
  PRIMARY KEY (`id`),
  UNIQUE KEY `account` (`account`),
  UNIQUE KEY `recommend` (`recommend`),
  KEY `parent` (`parent`),
  KEY `status` (`status`),
  KEY `is_del` (`is_del`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='用户表';

--
-- 转存表中的数据 `ss_user`
--

INSERT INTO `ss_user` (`id`, `account`, `parent`, `prefix_password`, `password`, `recommend`, `path`, `icp_coin`, `lock_icp_coin`, `usdt_coin`, `lock_usdt_coin`, `eth_coin`, `lock_eth_coin`, `btc_coin`, `lock_btc_coin`, `create_time`, `id_card`, `realname`, `id_photo`, `pass_err_time`, `comment`, `lock_time`, `status`, `is_del`) VALUES
(1, 'admin@gmail.com', 0, 'OWJjZmMz', '0x586ac39483366f49e494f0a21a85658a6331ecc6f31564009862b9111e538746', '00000000', '-1-', '964977.006163000000000000', '0.000000000000000000', '101453.989800000000000000', '0.000000000000000000', '1036.083748000000000000', '0.240000000000000000', '108.820861000000000000', '0.100000000000000000', 1674139671, '400118186117261263', 'Lily', 'http://song-swap-img.oss-cn-hongkong.aliyuncs.com/id-photo/U191QjRkU3FhaUJZdlV2RllKc2dyLTE%3D.png', 0, '', 0, 0, 0),
(2, 'test@yeah.net', 1, 'OGZmZDJk', '0x7fd1e09d8493c2696a932c7240b698bec5e3374a02a34fd66749e671ca38c08c', 'caa0bfb7', '-1-2-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '99.900000000000000000', '0.000000000000000000', 1674140118, '', '', '', 0, '', 0, 0, 0),
(3, 'test1@163.com', 2, 'Y2FhNDM3', '0xcaf1ed16b74bbf96e9bf6d35834b1c97d14a04dbd3c69880d44721051adc2ca7', '5e9762cd', '-1-2-3-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674140643, '', '', '', 0, '', 0, 0, 0),
(4, 'test2@163.com', 3, 'ZGQ5MDc5', '0xebc9eb283c41f64a87c6e20efcfbf1a3983e61bfb6dc21b4117883c22a10d888', '5486199c', '-1-2-3-4-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.001000000000000000', '0.000000000000000000', 1674141481, '', '', '', 0, '', 0, 0, 0),
(5, 'test3@163.com', 4, 'OGZjMThk', '0xc1bc7dbc023d86c07d7beaeed04dc5c9225acaa62ae899dccbe91aad510e8f39', '748d0cfe', '-1-2-3-4-5-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674141491, '', '', '', 0, '', 0, 0, 0),
(6, 'test4@163.com', 5, 'OWVkOGE0', '0x9eaa3a14d1d904243b06cb0960a014084962817945769a5258b7113acfe2fcaf', 'f485e289', '-1-2-3-4-5-6-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674141535, '', '', '', 0, '', 0, 0, 0),
(7, 'test5@163.com', 6, 'ZjA1MGUz', '0x20805af45ee9bde7a53f5bb7afa21abd7d6e10d4da4986af7ce6cd755a8ee617', '6e822f6b', '-1-2-3-4-5-6-7-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674141545, '', '', '', 0, '', 0, 0, 0),
(8, 'test6@163.com', 7, 'M2YwY2Y5', '0xa1ccf752cd90bd8622b4771857aabe33ea5bacdf2e43d74287f25f8aea11173e', '80b4b159', '-1-2-3-4-5-6-7-8-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674141567, '', '', '', 0, '', 0, 0, 0),
(9, 'test7@163.com', 8, 'MDY3NGY4', '0xe3f6156cd85f2fa1416ba09aa7a85bde2cef45bda359650da0407583480ce4c5', '49fd9153', '-1-2-3-4-5-6-7-8-9-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674141580, '', '', '', 0, '', 0, 0, 0),
(10, 'test8@163.com', 9, 'MGJlMzVi', '0xd5d3bd6f06201a0d75cfb69a7bbe566359cfd545081e69e09cd01499e24542eb', '5a2cb8e2', '-1-2-3-4-5-6-7-8-9-10-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674141639, '', '', '', 0, '锁定帐户', 1674206738, 1, 0),
(11, 'test9@163.com', 10, 'M2Y5Nzk4', '0x1fda5f370bbe522e2ae4a452f68047cc6a4ca745d1a545a279e4e320f38c481a', '13b54d48', '-1-2-3-4-5-6-7-8-9-10-11-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674141649, '', '', '', 0, '', 0, 0, 0),
(12, 'test10@163.com', 11, 'NDFkOTYz', '0xbce8fdcda51fc6ce2832743add65609fec5e8fb7fe5ebf627fd3653cfc378880', '26794a93', '-1-2-3-4-5-6-7-8-9-10-11-12-', '10.000000000000000000', '0.000000000000000000', '1020.000000000000000000', '0.000000000000000000', '1030.000000000000000000', '0.000000000000000000', '140.000000000000000000', '0.000000000000000000', 1674142332, '', '', '', 0, '', 0, 0, 0),
(13, 'test11@163.com', 12, 'ZDU3NWVl', '0x94ad6f1b86735bd714d8d524187577328cc39f6c54762201c584411e0300fd21', '2e8534bb', '-1-2-3-4-5-6-7-8-9-10-11-12-13-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674142342, '', '', '', 0, '', 0, 0, 0),
(14, 'test12@163.com', 13, 'YzhlZDhk', '0xa78baf9e2b5e972a3e44ad30127b9a52ce7ca6ea5a32e95b42ffe981d626b213', '5e1d9153', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674142362, '', '', '', 0, '', 0, 0, 0),
(15, 'test13@163.com', 14, 'NWZlM2Qw', '0x1b8d1cfe2b328ac5486815b51a8949a130bf422f10800e96d362317e1e464e21', '2f8c0d88', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '99.900000000000000000', '0.000000000000000000', 1674142370, '', '', '', 0, '', 0, 0, 0),
(16, 'test14@163.com', 15, 'YWY2MTNj', '0xae70ecf4f307fd6007543171f28463d884caa167d4e014e88afb5a9e5e6b924c', '712924d8', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '99.900000000000000000', '0.000000000000000000', 1674142393, '', '', '', 0, '', 0, 0, 0),
(17, 'test15@163.com', 16, 'OGU4NDM5', '0x1b1e106ce6d68815876953ea20d9a4a50488b9dbfe777387a7c854ff30402585', '0bd249e9', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-', '0.000000000000000000', '0.000000000000000000', '2000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '99.900000000000000000', '0.000000000000000000', 1674142403, '', '', '', 0, '', 0, 0, 0),
(18, 'test16@163.com', 17, 'NTNkMDdk', '0xd64435e253e7af9e4401e75d13df4f595b2f5698d65239f74f1613ff4fe1227f', '1eeff248', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-', '0.000000000000000000', '0.000000000000000000', '2000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '99.900000000000000000', '0.000000000000000000', 1674142422, '', '', '', 0, '', 0, 0, 0),
(19, 'test17@163.com', 18, 'Mzc3NWNj', '0x4ba270360341ba222691a1016ba69ede67fa867656e5ad009b8bd34e63465500', '8648bdff', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-', '0.000000000000000000', '0.000000000000000000', '1100.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '99.900000000000000000', '0.000000000000000000', 1674142463, '', '', '', 0, '', 0, 0, 0),
(20, 'test18@163.com', 19, 'MzkxMmZk', '0x8fac9550283e2b231c0f1152799db3177332967d4c4714b5a72d16f7f063fcd0', 'c0042f06', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '109.900000000000000000', '0.000000000000000000', 1674142483, '', '', '', 0, '', 0, 0, 0),
(21, 'test19@163.com', 20, 'MmQwMTlk', '0x1098f8debf8ce55c03382bb304b53eca3f884e75bb3f0e68f40491753b9b653d', '323975c1', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20-21-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '99.900000000000000000', '0.000000000000000000', 1674142491, '', '', '', 0, '', 0, 0, 0),
(22, 'test20@163.com', 21, 'ZTE5MmY3', '0x947145ef11316d4bf2c00f45e99f652f30613deb4fb0be459535821c78c13090', '7fa40510', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20-21-22-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674142506, '', '', '', 0, '', 0, 0, 0),
(23, 'test21@163.com', 22, 'N2JjMzgz', '0xdcacfd6bd28bc779a8cadd34009af4736685c0bb0cc44567391fb494c97e9b7c', 'f5f9fd17', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20-21-22-23-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674142514, '', '', '', 0, '', 0, 0, 0),
(24, 'test22@163.com', 23, 'ODdmN2Y2', '0x90a5ec8d8f6c7e4c9df8dc25e384c5e4d9cc1b71df66f929bbd964e51ddf98f1', '22272ddc', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20-21-22-23-24-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '999.890000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674142532, '', '', '', 0, '', 0, 0, 0),
(25, 'test23@163.com', 24, 'NTkyNzM1', '0x4d5c5b03fd960a796f7f7b1989e0895b846a69e60da4982209cf900c3d9f1256', 'e0cc8d98', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20-21-22-23-24-25-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674142540, '', '', '', 0, '', 0, 0, 0),
(26, 'test24@163.com', 25, 'Mjk5MDQw', '0xbf70cc16b024924a5bf9e23abb480014344b65ef2121fdb238c2270ffe3186ba', '4e712112', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20-21-22-23-24-25-26-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674142646, '', '', '', 0, '', 0, 0, 0),
(27, 'test25@163.com', 26, 'MGQwZmQx', '0x034c405addf70e9bf57a1f5570262d6a7fef18e77535e31b50f712be56b4eee5', '6b5528eb', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20-21-22-23-24-25-26-27-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674142656, '', '', '', 0, '', 0, 0, 0),
(28, 'test26@163.com', 27, 'MTlmNjZj', '0x8fb872df13bb43f8c3e2831fa777c6fb525d232830e0df4716682431cf57c341', 'db5b0fd2', '-1-2-3-4-5-6-7-8-9-10-11-12-13-14-15-16-17-18-19-20-21-22-23-24-25-26-27-28-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674142680, '', '', '', 0, '', 0, 0, 0),
(29, 'test0@yeah.net', 1, 'MTNlYTVj', '0x54ab9db153638f31576ef9c72c0871c365b81e5e63a2bae4bda4c309aac773a9', '3431a399', '-1-29-', '0.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '1000.000000000000000000', '0.000000000000000000', '100.000000000000000000', '0.000000000000000000', 1674151978, '', '', '', 0, '', 0, 0, 0),
(30, 'haha@yeah.net', 1, 'MjM1N2Yz', '0x0e0048bc40e3d48f5a5460f1575e814a283e8351d12cf7584a5cb23fbd2e522a', '558b4039', '-1-30-', '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', '0.000000000000000000', 1674818999, '', '', '', 0, '', 0, 0, 0);

-- --------------------------------------------------------

--
-- 表的结构 `ss_withdraw`
--

CREATE TABLE IF NOT EXISTS `ss_withdraw` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '提现ID',
  `account_id` int NOT NULL DEFAULT '0' COMMENT '提现账号',
  `transaction_hash` char(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '0x0000000000000000000000000000000000000000000000000000000000000000' COMMENT '交易hash',
  `withdraw_type` char(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'USDT' COMMENT '提现币种',
  `withdraw_count` decimal(50,18) NOT NULL DEFAULT '0.000000000000000000' COMMENT '提现数量',
  `from_address` char(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '0x0000000000000000000000000000000000000000' COMMENT '转出地址',
  `to_address` char(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '0x0000000000000000000000000000000000000000' COMMENT '转入地址',
  `create_time` int NOT NULL DEFAULT '0' COMMENT '创建时间',
  `check_account` char(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '' COMMENT '确认帐户',
  `check_time` int NOT NULL DEFAULT '0' COMMENT '确认时间',
  `status` tinyint NOT NULL DEFAULT '0' COMMENT '确认状态0:已提交 1:确认 -1:拒绝',
  PRIMARY KEY (`id`),
  KEY `status` (`status`)
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `ss_withdraw`
--

INSERT INTO `ss_withdraw` (`id`, `account_id`, `transaction_hash`, `withdraw_type`, `withdraw_count`, `from_address`, `to_address`, `create_time`, `check_account`, `check_time`, `status`) VALUES
(1, 1, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547525, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674804798, -1),
(2, 2, '0x0000000000000000000000000000000000000000000000000000000000000000', 'BTC', '0.100000000000000000', '0x0000000000000000000000000000000000000000', '0x0000000000000000000000000000000000000000', 1674547680, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674804798, 1),
(3, 3, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547686, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566246, -1),
(4, 4, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547692, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566243, -1),
(5, 5, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547699, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566241, -1),
(6, 6, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547705, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566238, -1),
(7, 7, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547710, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566236, -1),
(8, 8, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547715, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566233, -1),
(9, 9, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547721, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566229, -1),
(10, 11, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547736, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566226, -1),
(11, 12, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547743, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566224, -1),
(12, 13, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547749, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566221, -1),
(13, 14, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547756, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566216, -1),
(14, 15, '0x0000000000000000000000000000000000000000000000000000000000000000', 'BTC', '0.100000000000000000', '0x0000000000000000000000000000000000000000', '0x0000000000000000000000000000000000000000', 1674547765, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566210, 1),
(15, 16, '0x0000000000000000000000000000000000000000000000000000000000000000', 'BTC', '0.100000000000000000', '0x0000000000000000000000000000000000000000', '0x0000000000000000000000000000000000000000', 1674547772, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566207, 1),
(16, 17, '0x0000000000000000000000000000000000000000000000000000000000000000', 'BTC', '0.100000000000000000', '0x0000000000000000000000000000000000000000', '0x0000000000000000000000000000000000000000', 1674547779, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566205, 1),
(17, 18, '0x0000000000000000000000000000000000000000000000000000000000000000', 'BTC', '0.100000000000000000', '0x0000000000000000000000000000000000000000', '0x0000000000000000000000000000000000000000', 1674547785, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566203, 1),
(18, 19, '0x0000000000000000000000000000000000000000000000000000000000000000', 'BTC', '0.100000000000000000', '0x0000000000000000000000000000000000000000', '0x0000000000000000000000000000000000000000', 1674547793, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566201, 1),
(19, 20, '0x0000000000000000000000000000000000000000000000000000000000000000', 'BTC', '0.100000000000000000', '0x0000000000000000000000000000000000000000', '0x0000000000000000000000000000000000000000', 1674547800, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566198, 1),
(20, 21, '0x0000000000000000000000000000000000000000000000000000000000000000', 'BTC', '0.100000000000000000', '0x0000000000000000000000000000000000000000', '0x0000000000000000000000000000000000000000', 1674547808, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674566146, 1),
(21, 29, '', 'BTC', '0.100000000000000000', '', '0x0000000000000000000000000000000000000000', 1674547816, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674565956, -1),
(22, 24, '0x0000000000000000000000000000000000000000000000000000000000000000', 'ETH', '0.110000000000000000', '0x0000000000000000000000000000000000000000', '0x0000000000000000000000000000000000000000', 1674549778, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674565844, 1),
(23, 1, '', 'ETH', '0.120000000000000000', '', '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674877800, '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674565844, -1),
(24, 1, '', 'ETH', '0.120000000000000000', '', '0x7f120e9a4f727f4bc1b49bc439ce3393cc197366', 1674877870, '', 0, 0);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;